Tekla Open API Reference for Tekla Structures 2025
Localization.DefaultLocalizationPath Property
Note: This API is now obsolete.
 The path and directory name where to find localization files.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[ObsoleteAttribute("Please Use GetLocalizationFileFullPath")]
public static string DefaultLocalizationPath { get; }
<ObsoleteAttribute("Please Use GetLocalizationFileFullPath")>
Public Shared ReadOnly Property DefaultLocalizationPath As String
	Get
Property Value
Type: String
See Also
Reference
Localization Class
Tekla.Structures.Dialog Namespace